In [1]:
import pandas as pd
import numpy as np

In [8]:
Roll=[1,2,3,4,5,6]
Names=["Tanmay","Diksha","Nikita","Krishna","Ananya","Khayati"]

In [15]:
df=pd.DataFrame(Roll)
df.columns=['Roll Number']
df

   Roll Number
0            1
1            2
2            3
3            4
4            5
5            6

In [16]:
df['Names']=pd.Series(Names)

In [17]:
df

   Roll Number    Names
0            1   Tanmay
1            2   Diksha
2            3   Nikita
3            4  Krishna
4            5   Ananya
5            6  Khayati

In [20]:
data= {'Name':['Freya', 'Mohak'],'Age':[9,10],'Gender':['F','M']}
df1 = pd.DataFrame(data)
df1['Marks']=pd.Series([89,79])
print (df1)

    Name  Age Gender  Marks
0  Freya    9      F     89
1  Mohak   10      M     79

In [21]:
#If we have multiple dictionaries with us then each dictionary is represented as a different row

data1 = [{'x': 1, 'y': 2},{'x': 5, 'y': 4, 'z': 5}]
df2=pd.DataFrame(data1)
df2

   x  y    z
0  1  2  NaN
1  5  4  5.0

In [23]:
#if we have only one dictionary then all the keys are differnt columns 

d1 ={'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df3=pd.DataFrame(d1)
df3

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [24]:
df4=pd.read_table('Data1.txt', delim_whitespace=True,names=('A', 'B', 'C'))
df4

   A  B      C
0  1  1  12.92
1  1  2  90.75
2  1  3  60.90
3  2  1  71.34

In [25]:
df4['Total']=df4['A']+df4['B']+df4['C']
df4

   A  B      C  Total
0  1  1  12.92  14.92
1  1  2  90.75  93.75
2  1  3  60.90  64.90
3  2  1  71.34  74.34